Repository: Vito0912/flutter_remasp
Catalog: lib/l10n/intl_*.arb
Languages: de

# labelTitle
source: Register Machine
de: Registermaschine

# labelStartProgram
source: Start Program
de: Starte Programm

# labelStartSingleStep
source: Start Single-Step Mode
de: Starte Einzelschrittmodus

# labelNext
source: Next
de: Weiter

# labelStopProgram
source: Stop Program
de: Stoppe Programm

# labelResetRegisters
source: Clear Registers
de: Register leeren

# labelLoadRegisters
source: Load Registers
de: Register laden

# labelSaveRegisters
source: Save Registers
de: Register zwischenspeichern

# labelTimePerInstruction
source: Time per Instruction: {time}ms
de: Zeit pro Befehl: {time}ms

# labelMachineControl
source: Machine Control
de: Maschinensteuerung

# labelRegisterSettings
source: Register Settings
de: Registereinstellungen

# errorAnErrorOccurred
source: An error occurred.
de: Ein Fehler ist aufgetreten.

source: Close
de: Schließen

# errorNoInstructions
source: No instructions available. You must add at least one instruction!
de: Keine Befehle vorhanden. Du musst mindestens einen Befehl hinzufügen!

# errorRegisterOverflow
source: Register overflow - You should never reach this value :)
de: Registerüberlauf - Du solltest diesen Wert nie erreichen :)

# errorMissingLabel
source: The label {label} was not found. Please check your instructions.
de: Das Label {label} wurde nicht gefunden. Bitte überprüfe deine Befehle.

# errorNoInstructionsRunning
source: There are no instructions to execute, and the END command was not found.
de: Es sind keine Befehle zum Ausführen vorhanden und der END Befehl wurde nicht gefunden.

# errorNotAllowedToWriteTo0
source: You are not allowed to STORE in register 0.
de: Du darfst nicht in Register 0 STOREn.

# errorDivisionByZero
source: Division by 0 is not allowed.
de: Division durch 0 ist nicht erlaubt.

# errorNumberLoadingNotAllowed
source: You are not allowed to use a constant as an operand for STORE.
de: Du darfst keine Konstante als Operand für STORE benutzen.

# errorNotParseable
source: The instruction could not be parsed. Please check your instructions. Faulty instruction chain: {instruction}
de: Der Befehl konnte nicht geparst werden. Bitte überprüfe deine Befehle. Fehlerhafte Befehlskette: {instruction}

# errorLabelAlreadyExists
source: The label {label} already exists.
de: Das Label {label} ist doppelt vorhanden.

# errorBehindLabelInstruction
source: An instruction must follow a label.
de: Ein Befehl muss hinter einem Label stehen.

# errorInvalidInstruction
source: Invalid instruction in line {line}: {instruction}
de: Ungültiger Befehl in Zeile {line}: {instruction}
